app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby"], ["room_number", 20], ["created_at", "2019-10-25 03:50:01.035499"], ["updated_at", "2019-10-25 03:50:01.035499"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update

    @school_class = SchoolClass.find_by_id(params[:id])